Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Multiple tenants that can support the Bearer token authentication or Authorization Code Flow mechanisms
ja_jp: ベアラートークン認証または認可コードフローメカニズムをサポートする複数のテナント

source: Multiple transactional producers can participate in a single transaction. This ensures all messages are sent using the started transaction and before the transaction is committed, all participating producers are flushed.
ja_jp: 複数のトランザクションプロデューサーが 1 つのトランザクションに参加できます。 これにより、すべてのメッセージが開始したトランザクションを使用して確実に送信されます。また、トランザクションがコミットされる前に、参加しているすべてのプロデューサーがフラッシュされます。

source: Multiplier factor to determine maximum number of records queued for processing, using `max.poll.records` * `max-queue-size-factor`. Defaults to 2. In `batch` mode `max.poll.records` is considered `1`. Type: _int_
ja_jp: `max.poll.records` * `max-queue-size-factor` を使用して、処理のためにキューに入れられるレコードの最大数を決定する乗数係数。デフォルトは 2 です。 `batch` モードでは、 `max.poll.records` は `1` と見なされます。 Type: _int_

source: Multitenancy
ja_jp: マルチテナンシー

source: Multithreaded programs might require special attention when trying to understand their runtime behaviour. To demonstrate this, add this `MulticastResource` code to your project (example courtesy of link:https://github.com/apangin/java-profiling-presentation/blob/master/src/demo6/DatagramTest.java[Andrei Pangin's Java Profiling presentation]):
ja_jp: マルチスレッドプログラムは、ランタイムの動作を理解しようとするときに特別な注意が必要になる場合があります。これを実証するために、この `MulticastResource` コードをプロジェクトに追加します (この例は link:https://github.com/apangin/java-profiling-presentation/blob/master/src/demo6/DatagramTest.java[Andrei Pangin's Java Profiling presentation] からご提供いただいています):

source: Must be 19+, we recommend 21+
ja_jp: 19以上必須、21以上を推奨

source: Mutable JAR distribution is similar to the Fast JAR one except it also includes build time dependencies to support re-augmentation (re-building) of an application.
ja_jp: Mutable JAR ディストリビューションは Fast JAR ディストリビューションと似ていますが、アプリケーションの再拡張 (再構築) をサポートするためのビルドタイム依存関係も含まれている点が異なります。

source: Mutations
ja_jp: ミューテーション

source: Mutations are used when data is created, updated or deleted.
ja_jp: ミューテーションは、データの作成、更新、削除の際に使用されます。

source: Mutiny - Async for bare mortal
ja_jp: Mutinyによる非同期入門

source: Mutiny - Async for mere mortals
ja_jp: Mutiny - 一般の開発者の為の非同期

source: Mutiny - an intuitive and event-driven reactive programming library
ja_jp: Mutiny - 直感的でイベント駆動型のリアクティブ・プログラミング・ライブラリ

source: Mutiny 2 and Java Flow
ja_jp: Mutiny 2とJava Flow

source: Mutiny Integration in Quarkus
ja_jp: QuarkusにおけるMutiny インテグレーション

source: Mutiny Patterns
ja_jp: Mutinyパターン

source: Mutiny and Vert.x
ja_jp: MutinyとVert.x

source: Mutiny and the I/O Threads
ja_jp: Mutiny とI/Oスレッド

source: Mutiny and the Reactiverse
ja_jp: MutinyとReactiverse

source: Mutiny does not dispatch the original event downstream until the Uni returned by the callback emits an item:
ja_jp: Mutinyは、コールバックによって返されたUniがアイテムを放出するまで、元のイベントを下流にディスパッチしません。

source: Mutiny in Quarkus
ja_jp: QuarkusでのMutiny

source: Mutiny is an event-driven Reactive Programming library. Like other reactive programming libraries, it uses streams as the primary construct. These streams convey events, and your code processes these events. Most of the time, your code is only interested in item and failure events. But there are other kinds of events such as cancellation, request, completion, and so on.
ja_jp: Mutiny はイベント駆動型のリアクティブプログラミングライブラリです。他のリアクティブ・プログラミング・ライブラリと同様に、主要な構成要素としてストリームを使用します。これらのストリームはイベントを伝え、あなたのコードはこれらのイベントを処理します。ほとんどの場合、あなたのコードはアイテムイベントと失敗イベントにしか興味がありません。しかし、キャンセル、リクエスト、完了などの他の種類のイベントもあります。

source: Mutiny is an event-driven reactive programming library. It's not related to Vert.x. However, we have written a code generator that generates the Mutiny variant for the Vert.x API:
ja_jp: Mutiny はイベント駆動型のリアクティブプログラミングライブラリです。Vert.xとは関係ありませんが、Vert.x API用のMutiny版を生成するコードジェネレータを書いています。

source: Mutiny is an intuitive, reactive programming library.
ja_jp: Mutinyは、直感的でリアクティブなプログラミングライブラリです。

source: Mutiny is the primary API when dealing with the reactive features from Quarkus. It means that most extensions support Mutiny either by exposing an API returning Unis and Multis (such as reactive data sources or rest clients) or understanding when your methods return a Uni or a Multi (such as Quarkus REST (formerly RESTEasy Reactive) or Reactive Messaging).
ja_jp: Mutinyは、Quarkusのリアクティブ機能を扱う際の主要なAPIです。 つまり、ほとんどのエクステンションは、UniやMultisを返すAPI（リアクティブデータソースやレストクライアントなど）を公開するか、メソッドがUniやMultiを返す場合（Quarkus REST（旧RESTEasy Reactive）やReactive Messagingなど）を理解することで、Mutinyをサポートしています。

source: Mutiny is the primary API when dealing with the reactive features from Quarkus. It means that most extensions support Mutiny either by exposing an API returning Unis and Multis (such as reactive data sources or rest clients) or understanding when your methods return a Uni or a Multi (such as RESTEasy Reactive or Reactive Messaging).
ja_jp: Mutinyは、Quarkusのリアクティブな機能を扱う際の主要なAPIです。これは、ほとんどのエクステンションがMutinyをサポートしていることを意味しています。それは、UniやMultiを返すAPIを公開する（リアクティブデータソースやレストクライアントなど）か、メソッドがUniやMultiを返すときに理解する（RESTEasy ReactiveやReactive Messagingなど）かのどちらかです。

source: Mutiny is very different from the other reactive programming libraries. It takes a different approach to design your program. With Mutiny everything is event-driven: you receive events, and you react to them. This event-driven aspect embraces the asynchronous nature of distributed systems and provides an elegant and precise way to express continuation.
ja_jp: Mutinyは、他のリアクティブ・プログラミング・ライブラリとは大きく異なります。プログラムを設計するために異なるアプローチをとります。Mutinyでは、すべてがイベントドリブンです：イベントを受け取り、それに反応します。このイベント駆動型の側面は、分散システムの非同期性を受け入れ、継続性を表現するエレガントで正確な方法を提供します。

source: Mutiny made writing reactive services way easier for everyone
ja_jp: Mutinyは、リアクティブ・サービスを誰でも簡単に書けるようにしてくれました。

source: Mutiny offers two types that are both event-driven and lazy:
ja_jp: Mutinyには、2つ型を提供します。両方ともイベントドリブンであり、遅延評価されます。

source: Mutiny provides lots of other features. Head over to the https://smallrye.io/smallrye-mutiny[Mutiny documentation] to see many more examples, including the whole list of events and how to handle them.
ja_jp: Mutinyには他にもたくさんの機能があります。Mutinyの link:https://smallrye.io/smallrye-mutiny[ドキュメント]では、イベントの全リストとその処理方法など、さらに多くの例を見ることができます。

source: Mutiny through Examples
ja_jp: 事例で見るMutiny

source: Mutiny uses https://www.reactive-streams.org/[Reactive Streams]. `Multi` implements `Publisher` and enforces the back-pressure protocol. Emissions are constrained by the request emitted from the downstream subscribers. Thus, it does not overload the subscribers. Note that in some cases, you can’t follow this protocol (because the Multi emits events that can’t be controlled, such as time, or measures sensors). In this case, Mutiny provides a way to control the overflow using `onOverflow()`.
ja_jp: Mutinyは link:https://www.reactive-streams.org/[Reactive Streams]を使用しています。 `Multi` は `Publisher` を実装し、back-pressureプロトコルを実施しています。エミッションは、下流のサブスクライバから発せられるリクエストによって制約されます。したがって、サブスクライバーに過負荷をかけることはありません。なお、場合によっては、このプロトコルに従えないこともあります（Multiが時間や測定センサーなどの制御できないイベントを放出するため）。この場合、Mutinyは、 `onOverflow()` を使ってオーバーフローを制御する方法を提供します。

source: Mutiny, Reactive for Bare Mortals
ja_jp: Mutiny - 普通の人間のための非同期

source: Mutiny, which is the foundation of reactive programming in Quarkus, is integrated with the MicroProfile Context Propagation. This integration enables automatic capturing and restoring of context across asynchronous boundaries. To learn more about context propagation in Quarkus and Mutiny, refer to the xref:context-propagation.adoc[Context Propagation] guide.
ja_jp: Quarkus のリアクティブプログラミングの基盤である Mutiny は、MicroProfile Context Propagation と統合されています。この統合により、非同期境界を越えてコンテキストを自動的にキャプチャして復元できます。Quarkus と Mutiny のコンテキスト伝搬について詳しくは、xref:context-propagation.adoc[Context Propagation] ガイドを参照してください。

source: Mutual TLS
ja_jp: 相互 TLS

source: Mutual TLS (mTLS) authentication
ja_jp: Mutual TLS (mTLS) 認証

source: Mutual TLS Authentication
ja_jp: 相互TLS認証

source: Mutual TLS authentication
ja_jp: 相互 TLS 認証

source: Mutual TLS authentication mechanism
ja_jp: 相互 TLS 認証メカニズム

source: Mutual TLS token binding
ja_jp: 相互 TLS トークンバインディング

source: Mvnpm jars also allows you to use an https://developer.mozilla.org/en-US/docs/Web/HTML/Element/script/type/importmap[importmap], that will allow you to just use module imports, example `import { LitElement, html, css} from 'lit';`.
ja_jp: Mvnpm jars では、 https://developer.mozilla.org/en-US/docs/Web/HTML/Element/script/type/importmap[importmap] を使用することもできます。 これにより、モジュールのインポートのみを使用できるようになります (例: `import { LitElement, html, css} from 'lit';`)。

source: My dear colleague https://github.com/yrodiere[Yoann Rodière] (he is awesome too!) wrote some test infrastructure for it based on https://site.mockito.org[Mockito] (which uses https://bytebuddy.net/[ByteBuddy] under the hood). That was all good until we started noticing confusing and non reproducible failures in our tests with Mockito sometimes not actually calling the method we would expect.
ja_jp: 私の親愛なる同僚である link:https://github.com/yrodiere[Yoann Rodière]（彼も素晴らしい！）は、 link:https://site.mockito.org[Mockito]（これはフードの下で link:https://bytebuddy.net/[ByteBuddy]を使用します）に基づいて、そのためのテストインフラをいくつか書きました。しかし、すべて順調だったのは、Mockitoが実際に期待するメソッドを呼び出さないことがあり、テストが混乱したり、再現性のない失敗をしたりすることに気づくまででした。

source: My extension isn't showing up on extensions.quarkus.io
ja_jp: エクステンションが extensions.quarkus.io に表示されません

source: My favorite one is the new Qute example with a subatomic-particles generator :)
ja_jp: 私のお気に入りは、素粒子ジェネレーターを備えた新しいQuteのサンプルです :)

source: MySQL (container)
ja_jp: MySQL (コンテナー)

source: MySQL Client
ja_jp: MySQLクライアント

source: MySQL Limitations
ja_jp: MySQL の制限事項

source: MySQL database connector
ja_jp: MySQL データベースコネクター

source: MySQL limitations
ja_jp: MySQL の制限

source: N.B. if you opt in for this feature, Quarkus will not reset the state of the database between runs unless you explicitly configure it to.
ja_jp: 注：この機能を選択した場合、明示的に設定しない限り、Quarkusは実行中にデータベースの状態をリセットしません。

source: NA
ja_jp: 該当なし

source: NB: For Gradle project setup please see below, and for further reference consult the guide in the xref:gradle-tooling.adoc[Gradle setup page].
ja_jp: 注：Gradleプロジェクトのセットアップについては、以下を参照してください。また、詳細については、 link:gradle-tooling.html[Gradleセットアップページ]のガイドを参照してください。

source: NON-STANDARD FEATURES
ja_jp: 非標準機能

source: NOTE
ja_jp: 注意

source: NOTE: this feature will add a 5-10% performance overhead
ja_jp: 注意: この機能は、約 5-10% のパフォーマンスオーバーヘッドを発生させます。

source: Name
ja_jp: 名前

source: Name Constant
ja_jp: ネーム定数

source: Name of original AsciiDoc source file
ja_jp: 元のAsciiDocソースファイル名

source: Name of target file to redirect to
ja_jp: リダイレクト先となるファイル名

source: Name of the cookie containing a token. This property is effective only if `mp.jwt.token.header` is set to `Cookie`.
ja_jp: トークンを含む Cookie の名前。このプロパティーは、 `mp.jwt.token.header` が `Cookie` に設定されている場合にのみ有効です。

source: Name of the cookie containing a token. This property is effective only if `smallrye.jwt.token.header` is set to `Cookie`. This property is deprecated - use `mp.jwt.token.cookie`.
ja_jp: トークンを含むクッキーの名前。このプロパティ＝は、 `smallrye.jwt.token.header` が `Cookie` に設定されている場合にのみ有効です。 このプロパティーは非推奨です。 `mp.jwt.token.cookie` を使用してください。

source: Name of the cookie containing a token. This property will be effective only if `mp.jwt.token.header` is set to `Cookie`.
ja_jp: トークンを含む Cookie の名前。このプロパティーは、 `mp.jwt.token.header` が `Cookie` に設定されている場合にのみ有効になります。

source: Name of the cookie containing a token. This property will be effective only if `smallrye.jwt.token.header` is set to `Cookie`. This property is deprecated - use 'mp.jwt.token.cookie`.
ja_jp: トークンを含む Cookie の名前。このプロパティーは、 `smallrye.jwt.token.header` が `Cookie` に設定されている場合にのみ有効になります。このプロパティーは推奨されていません。'mp.jwt.token.cookie` を使用してください。

source: Name of the cookie containing a token. This property will be effective only if `smallrye.jwt.token.header` is set to `Cookie`. This property is deprecated - use `mp.jwt.token.cookie`.
ja_jp: トークンを含むクッキーの名前。このプロパティは、 `smallrye.jwt.token.header` が `Cookie` に設定されている場合にのみ有効です。 このプロパティは非推奨です - `mp.jwt.token.cookie` を使用してください。

source: Name of the dead letter topic where the failing messages will be sent
ja_jp: 失敗メッセージが送信されるデッドレタートピックの名前

source: Name of the descriptor set file to generate
ja_jp: 生成する記述子セットファイルの名前

source: Name of the initial subscription name of the dead letter topic
ja_jp: デッド・レタートピックの初期サブスクリプション名

source: Name of the retry topic where the failing messages will be sent
ja_jp: 失敗したメッセージが送信される再試行トピックの名前

source: Named Datasource Injection
ja_jp: 名前付きデータソースインジェクション

source: Named Datasources
ja_jp: 名前付きデータソース

source: Named HTTP Security policy will only be applied to requests matched by the `application.properties` path matching rules.
ja_jp: 名前付き HTTP セキュリティーポリシーは、 `application.properties` パスマッチングルールにマッチするリクエストにのみ適用されます。

source: Named Mongo client Injection
ja_jp: 名前付きMongoクライアントの注入

source: Named Redis Client Injection
ja_jp: 名前付きRedisクライアントのインジェクション

source: Named arguments can be accessed directly in the tag template. However, the first argument does not need to define a name and it can be accessed using the `it` alias. Furthermore, if an argument does not have a name defined and the value is a single identifier, such as `foo`, then the name is defaulted to the value identifier, e.g. `{#myTag foo /}` becomes `{#myTag foo=foo /}`. In other words, the argument value `foo` is resolved and can be accessed using `{foo}` in the tag template.
ja_jp: タグテンプレート内で、名前付き引数に直接アクセスできます。 ただし、最初の引数で名前を定義する必要はなく、 `it` エイリアスを使用してアクセスできます。 さらに、引数に名前が定義されておらず、値が `foo` など単一の識別子である場合、名前はデフォルトで値の識別子に設定されます (たとえば `{#myTag foo /}` は `{#myTag foo=foo /}` になります)。 つまり、引数値 `foo` は解決され、タグテンプレート内で `{foo}` を使用してアクセスできます。

source: Named arguments can be accessed directly in the tag template. However, the first argument does not need to define a name, and it can be accessed using the `it` alias. Furthermore, if an argument does not have a name defined and the value is a single identifier, such as `foo`, then the name is defaulted to the value identifier, e.g. `{#myTag foo /}` becomes `{#myTag foo=foo /}`. In other words, the argument value `foo` is resolved and can be accessed using `{foo}` in the tag template.
ja_jp: タグテンプレート内で、名前付き引数に直接アクセスできます。 ただし、最初の引数で名前を定義する必要はなく、`it` エイリアスを使用してアクセスできます。 さらに、引数に名前が定義されておらず、値が `foo` など単一の識別子である場合、名前はデフォルトで値の識別子に設定されます (たとえば `{#myTag foo /}` は `{#myTag foo=foo /}` になります)。 つまり、引数値 `foo` は解決され、タグテンプレート内で `{foo}` を使用してアクセスできます。

source: Named datasource injection
ja_jp: 名前付きデータソース注入

source: Named datasources
ja_jp: 名前付きデータソース

source: Named handlers attached to a category
ja_jp: カテゴリにアタッチされた名前付きハンドラー

source: Named handlers attached to the root logger
ja_jp: ルートロガーにアタッチされた名前付きハンドラー

source: Named proxies allow different clients or extensions to use different proxy configurations.
ja_jp: 名前付きプロキシーを使用すると、異なるクライアントまたはエクステンションで異なるプロキシー設定を使用できます。

source: Named proxy configuration
ja_jp: 名前付きプロキシー設定

source: Named queries
ja_jp: 名前付きクエリー

source: Named queries can only be defined inside your JPA entity classes (being the Panache entity class, or the repository parameterized type), or on one of its super classes.
ja_jp: 名前付きクエリーは、JPAのエンティティクラス（Panacheのエンティティクラスやリポジトリのパラメタライズドタイプ）の内部、またはそのスーパークラスのいずれかでしか定義できません。

source: Named queries can only be defined inside your Jakarta Persistence entity classes (being the Panache entity class, or the repository parameterized type), or on one of its super classes.
ja_jp: 名前付きクエリは、Jakarta Persistenceエンティティ・クラス（Panacheエンティティ・クラス、またはリポジトリのパラメータ化型）内部、またはそのスーパー・クラスの1つでしか定義できません。

source: Named queries can only be defined inside your Jakarta Persistence entity classes, or on one of their super classes.
ja_jp: 名前付きクエリは、Jakarta Persistence エンティティ クラス内、またはそのスーパークラスの 1 つでのみ定義できます。

source: Namespace
ja_jp: 名前空間

source: Namespace Extension Method Example
ja_jp: 名前空間拡張メソッドの例

source: Namespace Extension Methods
ja_jp: 名前空間拡張メソッド

source: Naming Convention for files
ja_jp: ファイルの命名規則

source: Naming Strategies
ja_jp: 命名戦略

source: Naming conventions
ja_jp: 命名規則

source: NamingStrategy
ja_jp: ネーミング戦略

source: Narayana JTA - Transaction manager
ja_jp: Narayana JTA - トランザクションマネージャー

source: Narayana LRA Participant Support
ja_jp: Narayana LRA 参加者サポート

source: Narayana LRA extension
ja_jp: Narayana LRA エクステンション

source: Narayana STM - Software Transactional Memory
ja_jp: Narayana STM - ソフトウェアトランザクショナルメモリー

source: Narayana Transaction Manager integration
ja_jp: Narayana トランザクションマネージャーの統合

source: Narayana transaction manager integration
ja_jp: Narayanaトランザクションマネージャの統合

source: Narayana, as the underlying transaction manager, has a concept of a unique node identifier. This is important if you consider using XA transactions that involve multiple resources.
ja_jp: Narayanaは、基礎となるトランザクションマネージャーであり、一意のノード識別子の概念を持っています。これは、複数のリソースを含む XA トランザクションの使用を検討している場合に重要です。

source: Native
ja_jp: ネイティブ

source: Native Executable Example
ja_jp: ネイティブ実行可能ファイル例

source: Native Executable Support
ja_jp: ネイティブ実行可能ファイルのサポート

source: Native Executable Testing
ja_jp: ネイティブ実行可能ファイルテスト

source: Native Executable:: the executable that is compiled to native 1s and 0s
ja_jp: Native Executable:: ネイティブの1と0にコンパイルされる実行可能ファイル

source: Native Executables
ja_jp: ネイティブ実行可能ファイル

source: Native Executables and Private Members
ja_jp: ネイティブ実行可能ファイルとプライベートメンバー

source: Native Image
ja_jp: ネイティブイメージ

source: Native Image Compatibility
ja_jp: Native Image 互換性

source: Native Image Pre-Boot
ja_jp: ネイティブイメージのプリブート

source: Native Image Tracing Agent Integration
ja_jp: ネイティブイメージトレースエージェントのインテグレーション

source: Native Integration with Generative AI
ja_jp: 生成AIとのネイティブ統合

source: Native Integration with Generative AI icon
ja_jp: 生成AIとのネイティブ統合アイコン

source: Native Linux Transport
ja_jp: ネイティブLinuxトランスポート

source: Native Linux transport
ja_jp: Linuxのネイティブ・トランスポート

source: Native MacOS Transport
ja_jp: ネイティブMacOSトランスポート

source: Native Memory Management
ja_jp: ネイティブメモリ管理

source: Native Memory Tracking
ja_jp: ネイティブメモリのトラッキング

source: Native Reference
ja_jp: ネイティブリファレンス

source: Native Reference Guide
ja_jp: ネイティブリファレンスガイド

source: Native Reports
ja_jp: ネイティブレポート

source: Native Transport
ja_jp: ネイティブトランスポート

source: Native and named queries when using `@Query`
ja_jp: `@Query` を使用する場合のネイティブクエリーと名前付きクエリー

source: Native compilation
ja_jp: ネイティブコンパイル

source: Native compilation eliminates the need for a JVM in the production environment because the produced binary includes the runtime and is optimized for minimal resource usage.
ja_jp: ネイティブコンパイルでは、生成されたバイナリーにランタイムが含まれ、リソースの使用が最小限になるように最適化されるため、実稼働環境で JVM が不要になります。

source: Native compilation will always take some time to complete; then, you'll be able to run this binary directly:
ja_jp: ネイティブ・コンパイルにはどの場合も時間がかかりますが、その後、このバイナリを直接実行できるようになります:

source: Native executable
ja_jp: ネイティブ実行可能ファイル

source: Native executable compression
ja_jp: ネイティブ実行可能ファイルの圧縮

source: Native executable container image
ja_jp: ネイティブ実行可能コンテナイメージ

source: Native executable fails on macOS with `error: unknown type name 'uint8_t'`
ja_jp: macOS でのネイティブ実行可能ファイルが `error: unknown type name 'uint8_t'` で失敗する

source: Native executable generation is a multi-step process. The analysis and compile steps are the most expensive of all and hence the ones that dominate the time spent generating the native executable.
ja_jp: ネイティブ実行可能ファイルの生成は、複数のステップで構成されています。その中でも解析とコンパイルのステップは最もコストがかかるため、ネイティブ実行可能ファイルの生成にかかる時間の大半を占めます。

source: Native executable generation is the result of two Java processes that are executed sequentially. The first process is very short and its main job is to set things up for the second process. The second process is the one that takes care of most of the work. The steps to debug one process or the other vary slightly.
ja_jp: ネイティブ実行可能ファイルの生成は、2つのJavaプロセスが順次実行された結果です。最初のプロセスは非常に短く、主な仕事は2番目のプロセスのために物事を準備することです。2つ目のプロセスは、ほとんどの作業を行うものです。一方のプロセスをデバッグするための手順は、若干異なります。

source: Native executables can be debugged using tools such as `gdb`. For this to be possible native executables need to be generated with debug symbols.
ja_jp: ネイティブ実行可能ファイルは、 `gdb` などのツールを使用してデバッグできます。 これを可能にするには、ネイティブ実行可能ファイルをデバッグシンボルとともに生成する必要があります。

source: Native executables include not only the application code but also, library code, and JDK code. As a result a more fair comparison would be to compare the native executable’s size with the size of the application, plus the size of the libraries it uses, plus the size of the JDK. Especially the JDK part is not negligible even in simple applications like HelloWorld. To get a glance on what is being pulled in the image one can use `-H:+PrintUniverse` when building the native executable.
ja_jp: ネイティブ実行可能ファイルには、アプリケーションのコードだけでなく、ライブラリのコードやJDKのコードも含まれています。そのため、ネイティブ実行可能ファイルのサイズは、アプリケーションのサイズに加えて、使用するライブラリのサイズとJDKのサイズを加えたものと比較するのが、より公平な比較となります。特にJDKの部分は、HelloWorldのようなシンプルなアプリケーションでも無視できません。イメージの中で何が引き出されているかを把握するために、ネイティブ実行可能ファイルをビルドする際に `-H:+PrintUniverse` を使用することができます。

source: Native executables make Quarkus applications ideal for containers and serverless workloads.
ja_jp: ネイティブ実行可能ファイルにより、Quarkusアプリケーションはコンテナーやサーバーレスのワークロードに最適です。

source: Native executables supports JDK Flight Recorder. This extension also supports native executables.
ja_jp: ネイティブ実行可能ファイルは JDK Flight Recorder をサポートします。このエクステンションはネイティブ実行可能ファイルもサポートします。

source: Native executables supports Java Flight Recorder. This extension also supports native executables.
ja_jp: ネイティブ実行可能ファイルは Java Flight Recorder をサポートします。 このエクステンションはネイティブ実行可能ファイルもサポートします。

source: Native image
ja_jp: ネイティブイメージ

source: Native image builds are significantly slower. This typically does not affect the inner development loop (except when debugging native-specific issues), but it can have a noticeable impact on CI resources.
ja_jp: ネイティブイメージのビルドは著しく遅くなります。これは通常、内部開発ループに影響を与えませんが（ネイティブ固有の問題をデバッグする場合を除く）、CI リソースに顕著な影響を与える可能性があります。

source: Native image tracing agent integration is included in Quarkus to make the agent easier to consume. In this section you will learn about the integration and how to apply it to your Quarkus application.
ja_jp: エージェントをより簡単に使用できるように、Quarkus にはネイティブイメージトレーシングエージェントの統合が含まれています。 このセクションでは、インテグレーションと、そのインテグレーションを Quarkus アプリケーションに適用する方法について学習します。

source: Native images were originally one of the features we were least concerned with but guess what? They worked great with almost no issues.
ja_jp: ネイティブイメージは、元々はあまり気にしていなかった機能のひとつでしたが、どうでしょう？ほとんど問題なく動作しています。

source: Native macOS Transport
ja_jp: ネイティブMacOSトランスポート

source: Native macOS transport
ja_jp: macOSのネイティブ・トランスポート

source: Native mode
ja_jp: ネイティブモード

source: Native mode support
ja_jp: ネイティブモードのサポート

source: Native related properties can either be added in `application.properties` file, as command line arguments or in the `quarkusBuild` task. Configuring the `quarkusBuild` task can be done as following:
ja_jp: ネイティブ関連のプロパティーは、 `application.properties` ファイルにコマンドライン引数として追加するか、 `quarkusBuild` タスクに追加することができます。 `quarkusBuild` タスクの設定は以下のように行います:

source: Native transports are not supported in GraalVM produced binaries.
ja_jp: GraalVMで作られたバイナリでは、ネイティブトランスポートはサポートされていません。

source: Native transports are not supported in native executables.
ja_jp: ネイティブ・トランスポートは、ネイティブ実行可能ファイルではサポートされていません。

source: Naturally this handling is per REST Client. `@ClientExceptionMapper` uses the default priority if the `priority` attribute is not set and the normal rules of invoking all handlers in turn apply.
ja_jp: 当然、この処理は REST クライアントごとに行われます。 `@ClientExceptionMapper` は、 `priority` 属性が設定されておらず、すべてのハンドラーを呼び出す通常のルールが適用される場合、デフォルトの優先度を使用します。

source: Naturally, if you want to declare templates at the top-level, directly in `/src/main/resources/templates/hello.txt`, for example, you can declare them in a top-level (non-nested) `Templates` class:
ja_jp: 当然のことながら、トップレベルでテンプレートを宣言したい場合、例えば `/src/main/resources/templates/hello.txt` で直接宣言したい場合は、トップレベル(非入れ子)の `Templates` クラスで宣言することができます:
